import { useParams } from "react-router-dom";
import Breadcrumb from "../../components/Breadcrumb/Breadcrumb";
import PostsDetails from "../../components/PostsDetails/PostsDetails";
import allData from "../../data/allData";
import ArticlesLabel from "../../components/ArticlesLabel/ArticlesLabel";
import CourseComments from "../../components/CourseComments/CourseComments";
const ArticlesDetails = (): JSX.Element => {
  const { articleName } = useParams();

  const mainArticle = allData.find((article) => article.title === articleName);
  return (
    <section className="">
      <Breadcrumb
        title="مقالات"
        previousPage="مقالات"
        previousPageLink="/articles"
        currentPage={mainArticle?.title}
      />
      <div className="container">
        <div className="border border-fourth rounded-lg mt-8 bg-white p-4 text-[#464749]">
          <h1 className="text-xl my-2 border-b-2 border-solid border-[#f3f3f3] pb-4">
            {mainArticle?.title}
          </h1>
          <div className="flex flex-wrap gap-4 text-[#c7c7c7] text-xs my-5">
            <PostsDetails />
          </div>
          <div className="w-full shadow-[0_1px_2px_rgba(0,0,0,.075)]">
            <img
              src={mainArticle?.imgBig}
              className="w-full h-auto object-cover"
              alt="عکس مقاله"
            />
          </div>
          <div className="leading-8 mt-5 text-sm">
            <p>
              موفق شدن و رسیدن به خواسته‌ ها به خود شما بستگی دارد. من می­‌توانم
              میلیون­‌ها روش دیگر را در مورد اینکه چگونه موفق شویم؟ لیست کنم اما
              اگر شما تمایلی به انجام کار نداشته باشید، این روش‌­ها کار نخواهند
              کرد. دو انتخاب دارید:
            </p>
            <p>
              <span className="block">
                انتخاب اول: شروع کنید به ساخت چیزی مانند یک مغازه، یک وبلاگ، یک
                اپلیکیشن و…
              </span>
              انتخاب دوم: در مقابل خودتان اعتراف کنید که واقعا نمی­‌خواهید موفق
              شوید، بلکه تنها از این ایده خوشتان می­‌آید. بقیه روزتان را هم به
              دیدن یک نمایش ماراتون در نتفلیکس بگذرانید
            </p>
            <p className="mt-5">
              من از گذشته تا به حال و در طول 20 سال حضور در حرفه ورزشی، توسط
              تعدادی از مربیان کره زمین آموزش دیدم. اما زمانی که می­خواستم شرکت
              خودم را تاسیس کنم تا اطلاعات و دانشم راجع به روانشناسی و
              آموزش­‌هایی که دیده بودم را به اشتراک بگذارم، آن قدر که فکر
              می­‌کردم این کار، کار ساده‌­ای نبود. پس چگونه موفق شویم؟
            </p>
            <p>
              ایجاد یک کسب­ و کار جدید، کار ساده‌­ای نیست. شما باید فکر این
              باشید که پول ماهانه را کنار بگذارید تا بتوانید در ناشناخته‌­ها غرق
              شوید و اتفاقات غیرقابل پیش‌­بینی را تجربه کنید. بسیاری از چیزها ما
              را از جهش و تغییر دور می‌­کند. مانند ترس یا حس عدم امنیت؛ اما چیزی
              بیش از همه موارد ما را به پیش می‌برد: انگیزه.
            </p>
            <h3 className="text-xl my-2">چگونه موفق شویم؟</h3>
            <p className="mb-2">
              وقتی به روزهایی که ورزشکار بودم برمی­‌گردم، متوجه تفاوت می­‌شوم.
              به یاد می­‌آوردم که چه چیزی یا چه کسی مرا مجبور می­‌کرد تا به خودم
              فشار بیاورم، حتی زمانی که خودم نمی­‌خواستم. تفاوت اینجا بود که من
              به عنوان یک ورزشکار، روزهای ساختار یافته و مشخصی داشتم و باید برای
              هر روز به مربی خود گزارش می‌­دادم. برنامه ساختار یافته، ما را
              متمرکز نگه می­‌دارد. مربی نیز به ما فشار می­‌آورد و ما را به چالش
              می‌­کشد.
            </p>
            <p className="mb-2">
              خوشبختانه من از این مرحله گذر کردم و آموزش Onbo را پیدا کردم. Onbo
              یک سرویس مربیگری آنلاین است که به مردم کمک می‌­کند تا به اهداف خود
              برسند. من تصمیم گرفتم تا درس­‌هایی که تاکنون یاد گرفت‌ه­ام را
              جمع­‌آوری کنم و آنها را با دیگر افرادی مانند شما، که تلاش می­‌کنند
              فرد بهتری باشند و برای رسیدن به خواسته ها مصمم هستند؛ به اشتراک
              بگذارم. برای رسیدن به موفقیت حتما این نکات را مطالعه کنید.
            </p>
            <h4 className="text-base font-vazirMedium mt-3 mb-2">
              1- از پیدا کردن گلوله نقره‌­ای و جادویی دست بردارید
            </h4>
            <p className="mb-2">
              گلوله نقره‌­ای چیزی است که نیاز دارید تا هر روز و به مدت سال­‌ها،
              در کار خود قرار دهید. این گلوله نه هکی در تبلیغات فیسبوک است و نه
              یک کنفرانس 2000 دلاری جادویی.
            </p>
            <p className="mb-2">
              مهم نیست چندبار مردم به شما می‌گویند که باید همچنان در اطراف
              بگردید تا پاسخ این راز مخفی را پیدا کنید. چرا مهم نیست؟ اگر مهم
              نیست پس چگونه موفق شویم؟ چون شما نمی­‌خواهید آن را در کار خود
              استفاده کنید. شما تنها می­‌خواهید که یک شبه به موفقیت برسید. این
              امکان‌­پذیر نیست. اگر من به جای شما بودم، شروع می­‌کردم به ایجاد
              اهداف بهتر.
            </p>
            <h4 className="text-base font-vazirMedium mt-3 mb-2">
              2- تلاش کنید تا اهداف بهتری ایجاد کنید
            </h4>
            <p className="mb-2">
              “هدف من این است که یک تُن پول بدست بیاورم.” و شما در تعجب هستید که
              چرا تا به حال این مقدار پول را بدست نیاورده‌­اید! هدف شما عملی
              نیست. اگر بخواهیم واضح بگوییم، این هدف انگیزه‌­ای هم ایجاد
              نمی­‌کند. پول خیلی خوب است اما شما را خشنود و کامل نمی­‌کند هدف
              اصلی شما از زندگی چیست؟ شاید موفق بودن برای شما به این معنی است که
              کاری کنید که اقیانوس­‌های جهان تمیز شوند یا به حیوانات کمک کنید و
              از منقرض شدن آن‌ها جلوگیری کنید. با این حال، شما این کار را چگونه
              انجام می­‌دهید؟
            </p>
            <p className="mb-2">
              بسیار خوب، شما به پول نیاز دارید و این جایی است که هدف پول معنا
              پیدا می­‌کند. چقدر پول لازم دارید تا به حل شدن این مشکلات کمک
              کنید؟ یک ماشین حساب بردارید. از برخی افراد بی دغدغه کمک بگیرید و
              شروع به محاسبه اعداد کنید. سپس عدد دقیق محاسبه شده را هدف خود قرار
              دهید و یک تاریخ دقیق برای رسیدن به آن یادداشت کنید. “من می­خواهم
              103.467.37 دلار را تا 31 دسامبر 2018 بدست آوردم و آن را برای تمیز
              کردن اقیانوس‌های دنیا سرمایه­‌گذاری کنم تا بدین ترتیب بتوانم از
              اقیانوس محافظت کنم و آب نوشیدنی تمیزی داشته باشم.” حالا هم یک هدف
              مشخص دارید و هم یک روز برای رسیدن به آن.
            </p>
            <h4 className="text-base font-vazirMedium mt-3 mb-2">
              3- به دنبال تایید نباشید
            </h4>
            <p className="mb-2">
              verify- تایید کردن شما اگر می‌خواهید بدانید چگونه موفق شویم؟ لطفا
              هرگز به دنبال تایید نباشید. قرار نیست آن راه را در افرادی که اطراف
              شما هستند پیدا کنید. مگر اینکه هر کس که در اطراف شماست موفقیت
              بزرگی به دست آورده باشد. نیازی نیست مادر، پدر، بهترین دوستان، شریک
              و سگ شما ایده­‌های کاری شما را تایید کنند. زندگی را به روش خودتان
              و آن‌طور که می­‌خواهید زندگی کنید. دنبال این نباشید که دیگران
              تایید کنند که شما در مسیر درست قرار دارید.
            </p>
            <p className="mb-2">
              می­‌خواهید بدانید آیا در مسیر درست هستید یا نه؟ از خودتان بپرسید
              “آیا در حال حاضر آن‌طور که می‌­خواهم زندگی می­‌کنم؟” اگر جواب شما
              مثبت بود، در مسیر درست قرار دارید. اگر جواب منفی بود، باید
              تغییراتی در زندگی خود ایجاد کنید. نگذارید دیگر افراد ذهن شما را به
              هم بریزند. مردم همیشه فکر می­‌کنند که می­‌دانند بهترین چیز برای
              شما چیست. اما این فقط شما هستید که جواب را می­‌دانید. کمی بیشتر به
              خودتان اعتماد کنید. خواهید فهمید که می­‌دانید چه کاری باید انجام
              دهید.
            </p>
            <h4 className="text-base font-vazirMedium mt-3 mb-2">
              4- زندگی رویایی خود را داشته باشید
            </h4>
            <p className="mb-2">
              موفق شدن در زندگی این نیست که در یک لحظه جادویی، همه چیز در سر جای
              خود قرار بگیرد. موفق شدن مربوط به لحظات کوچک در طول این مدت است.
              لحظاتی که شما خوشحال هستید و به دنبال رسیدن به خواسته‌ ها به سر
              می‌برید. لحظاتی که واقعا در آن غرق شده­‌اید.
            </p>
            <p className="mb-2">
              حقیقت آن است که شما می‌­توانید این لحظات را تجربه کنید، حتی اگر در
              حال حاضر در کاری خسته کننده گیر کرده باشید. اگر هدف شما این است که
              یک کسب­ و کار آنلاین راه بیاندازید، بعد از ظهرها و آخر هفته­‌هایی
              را خواهید داشت که می­‌توانید این کار را شروع کنید. شاید بخواهید که
              از راه دور کار کنید. در این حالت می‌­توانید با رئیس خود صحبت کرده
              و در مدت زمانی که در شهر خود نیستید، کارهایتان را از راه دور انجام
              دهید.
            </p>
          </div>
        </div>
        <ArticlesLabel />
        <CourseComments />
      </div>
    </section>
  );
};

export default ArticlesDetails;
