import {
  FaEnvelopeOpenText,
  FaMobileAlt,
  FaInstagram,
  FaTelegramPlane,
} from "react-icons/fa";

import { MdLocationPin } from "react-icons/md";

import { allDataType } from "../types/coursesInterface";

const allData: allDataType[] = [
  {
    id: 1,
    title: "آموزش فتوشاپ ",
    img: "./assets/images/products/product-1.webp",
    prerequisite: "پیش نیاز ندارد",
    stars: 5,
    teacher: "مصطفی میر هادی",
    students: 257,
    price: 200_000,
    count: 1,
    caption:
      "در پکیج آموزش فتوشاپ بعد از آموزش کامل تمام ابزارهای مورد نیاز برای طراحی انواع کاور و تامنیلو لوگو و.. ، در اختیار شما قرار گرفته است.",
    time: "9 ساعت و 20 دقیقه",
    type: "graphicCourse",
    sortType: "cheapest",
  },
  {
    id: 2,
    title: "آموزش ایلوستریتور ",
    img: "./assets/images/products/product-2.webp",
    prerequisite: "پیش نیاز ندارد",
    stars: 5,
    teacher: "مصطفی میر هادی",
    students: 357,
    price: 320_000,
    count: 1,
    caption:
      "در پکیج آموزش ایلوستریتور بعد از آموزش کامل تمام ابزارهای مورد نیاز برای طراحی  لوگو و.. ، در اختیار شما قرار گرفته است.",
    time: "12 ساعت و 51 دقیقه",
    type: "graphicCourse",
    sortType: "cheapest",
  },
  {
    id: 3,
    title: "آموزش پریمیر ",
    img: "./assets/images/products/product-3.webp",
    prerequisite: "پیش نیاز ندارد",
    stars: 5,
    teacher: "حسین رحیمی",
    students: 435,
    price: 380_000,
    count: 1,
    caption:
      "در پکیج آموزش پریمیر بعد از آموزش کامل تمام ابزارهای مورد نیاز برای ادیت انواع ویدیو و.. ، در اختیار شما قرار گرفته است.",
    time: "14 ساعت و 5 دقیقه",
    type: "graphicCourse",
    sortType: "date",
  },
  {
    id: 4,
    title: "آموزش  افتر افکت",
    img: "./assets/images/products/product-4.webp",
    prerequisite: "پیش نیاز ندارد",
    stars: 5,
    teacher: "حسین رحیمی",
    students: 600,
    price: 550_000,
    count: 1,
    caption:
      "در پکیج آموزش افتر افکت بعد از آموزش کامل تمام ابزارهای مورد نیاز برای ساخت انواع استوری موشن یا انمیشن و.. ، در اختیار شما قرار گرفته است.",
    time: "9 ساعت و 10 دقیقه",
    type: "graphicCourse",
    sortType: "date",
  },
  {
    id: 5,
    title: " آموزش ادوبی ایکس دی ",
    img: "./assets/images/products/product-5.webp",
    prerequisite: "پیش نیاز ندارد",
    stars: 5,
    teacher: "مصطفی میر هادی",
    students: 150,
    price: 180_000,
    count: 1,
    caption:
      "در پکیج آموزش ادوبی ایکس دی  بعد از آموزش کامل تمام ابزارهای مورد نیاز برای ساخت انواع رابط کاربری، در اختیار شما قرار گرفته است.",
    time: "11 ساعت و 30 دقیقه",
    type: "graphicCourse",
    sortType: "cheapest",
  },
  {
    id: 6,
    title: "آموزش این دیزاین ",
    img: "./assets/images/products/product-6.webp",
    prerequisite: "پیش نیاز ندارد",
    stars: 5,
    teacher: "مصطفی میر هادی",
    students: 45,
    price: 460_000,
    count: 1,
    caption:
      "در پکیج آموزش  این دیزاین بعد از آموزش کامل تمام ابزارهای مورد نیاز برای ساخت انواع جلد کتاب ، در اختیار شما قرار گرفته است.",
    time: "8 ساعت و 35 دقیقه",
    type: "graphicCourse",
    sortType: "date",
  },

  {
    id: 7,
    title: "آموزش Html ",
    img: "./assets/images/products/product-1.webp",
    prerequisite: "پیش نیاز ندارد",
    stars: 5,
    teacher: " محمد زینالی",
    students: 990,
    price: 300_000,
    count: 1,
    caption:
      "اولین قدم شروع طراحی وبسایت، آموزش HTML هست. HTML یه زبان نشانه گذاری هست که با کمک اون میتونی تگ هایی بنویسی تا سایت رو روی اون تگ ها پیاده کنی",
    time: "5 ساعت",
    type: "programmingCourses",
    sortType: "rating",
  },
  {
    id: 8,
    title: "آموزش Css ",
    img: "./assets/images/products/product-2.webp",
    prerequisite: "Html",
    stars: 5,
    teacher: " محمد زینالی",
    students: 889,
    price: 320_000,
    count: 1,
    caption: `تا اینجای کار با HTML آشنا شدی و میتونی اسکلت یه سایتو پیاده کنی دمت گرم. یه قدم بزرگ برداشتی.
حالا وقتشه که با یادگیری CSS به اسکلتی که ساختی پوست و گوشت بدی تا تبدیل به یه موجود زیبا بشه. Css این کارو برات انجام میده.`,
    time: "10 ساعت و 36 دقیقه",
    type: "programmingCourses",
    sortType: "rating",
  },
  {
    id: 9,
    title: "آموزش جاوا اسکریپت ",
    img: "./assets/images/products/product-3.webp",
    prerequisite: "Html & Css",
    stars: 5,
    teacher: "مصطفی میر هادی",
    students: 2300,
    price: 880_000,
    count: 1,
    caption:
      "آموزش جاوا اسکریپت برای تمامی افرادی ک قصد ورود به زبان برنامه نویسی دارند مناسب می باشد . خصوصا برای علاقه مندان به حوزه فرانت همان طور که می دانید جاوا اسکریپت یکی از زبان های برنامه نویسی محبوب و پر طرفدار است که بازار کار فوق العاده ای دارد",
    time: "91 ساعت و 20 دقیقه",
    type: "programmingCourses",
    sortType: "rating",
  },
  {
    id: 10,
    title: "آموزش React.js",
    img: "./assets/images/products/product-4.webp",
    prerequisite: "Html & Css & JavaScript",
    stars: 5,
    teacher: "محمد زینالی",
    students: 600,
    price: 2_000_000,
    count: 1,
    caption:
      "ری اکت گل سرسبد فرانت اند محسوب میشود،اگر دوره react را ببینید، بازار کار فرانت اند پیشنهادهای بسیار شگفت انگیزی برای شما خواهد داشت! در این دوره شما آموزش ری اکت رابر اساس تجربیات مدرس در دنیای واقعی و کار با شرکت های مختلف ایرانی یاد می گیرید",
    time: "45 ساعت و 30 دقیقه",
    type: "programmingCourses",
    sortType: "expensive",
  },
  {
    id: 11,
    title: " آموزش Next.js ",
    img: "./assets/images/products/product-5.webp",
    prerequisite: "React.js",
    stars: 5,
    teacher: "مصطفی میر هادی",
    students: 900,
    price: 3_000_000,
    count: 1,
    caption:
      "نکست یه فریمورک مبتنی بر ری‌اکت هست که امروزه تو بازار کار یکی از مهم‌ترین تکنولوژی‌ها برای توسعه دهنده های ری‌اکت به حساب میاد. نکست رو میشه مکمل ری‌اکت دونست. یعنی هر چی که ری‌اکت داره نکست هم داره،",
    time: "35 ساعت و 30 دقیقه",
    type: "programmingCourses",
    sortType: "expensive",
  },
  {
    id: 12,
    title: "آموزش تایپ اسکریپت ",
    img: "./assets/images/products/product-6.webp",
    prerequisite: "TypeScript",
    stars: 5,
    teacher: "محمد زینالی",
    students: 358,
    price: 2_100_000,
    count: 1,
    caption:
      "تایپ اسکریپت یه زبون برنامه نویسیه که توسط مایکروسافت ارائه شده و یسری قابلیت و فیچر های جدید رو با هدف افزایش پرفورمنس و کاهش احتمال خطا به جاوا اسکریپت اضافه کرده.",
    time: "15 ساعت و 15 دقیقه",
    type: "programmingCourses",
    sortType: "expensive",
  },
  ///////////////////////////// End Courses //////////////////////////////////
  {
    id: 13,
    time: "3 اکتبر 2023",
    img: "./assets/images/radio/radio-1.webp",
    title: "۱۰ راز مهم برای موفقیت در کسب‌و‌کار اینترنتی",
    caption:
      " موفقیت در کسب‌و‌کار اینترنتی نیازمند انجام کارهایی است که شاید برخلاف تصور سایرین باشد. سال..",
    audio: "./assets/music/music-1.mp3",
    type: "radio",
  },
  {
    id: 14,
    time: "3 جولای 2023",
    img: "./assets/images/radio/radio-2.webp",
    title: "سئو کلاه سیاه و کلاه سفید چه تفاوتی دارند",
    caption:
      "  احتمالاً اگر کسب‌وکار اینترنتی داشته‌اید و با سئو سرکار داشته باشید لفظ سئو کلاه‌ سیاه..",
    audio: "./assets/music/music-2.mp3",
    type: "radio",
  },
  {
    id: 15,
    time: "3 می 2023",
    img: "./assets/images/radio/radio-3.webp",
    title: "فقط روی یک کسب‌و‌کار متمرکز شوید",
    caption:
      " موفقیت در کسب‌و‌کار اینترنتی نیازمند انجام کارهایی است که شاید برخلاف تصور سایرین باشد. سال..",
    audio: "./assets/music/music-3.mp3",
    type: "radio",
  },
  ///////////////////////////// End Radio //////////////////////////////////

  {
    id: 16,
    title: "افزودن دکمه تماس در سایت وردپرسی",
    img: "./assets/images/articles/article-sm-1.webp",
    imgBig: "../assets/images/articles/article-lg-1.webp",
    caption:
      "امروز در خدمتتان هستیم با آموزش افزودن دکمه تماس در سایت وردپرسی . در این.",
    type: "articles",
  },
  {
    id: 17,
    title: "معرفی بهترین نرم افزارهای مدیریتی برای دورکاری",
    img: "./assets/images/articles/article-sm-2.webp",
    imgBig: "../assets/images/articles/article-lg-2.webp",
    caption:
      "	موفق شدن و رسیدن به خواسته‌ ها به خود شما بستگی دارد. من می­‌توانم میلیون­‌ها.",
    type: "articles",
  },
  {
    id: 18,
    title: "چگونه به یک مدیر کسب و کار تبدیل شویم؟",
    img: "./assets/images/articles/article-sm-3.webp",
    imgBig: "../assets/images/articles/article-lg-3.webp",
    caption:
      "	موفق شدن و رسیدن به خواسته‌ ها به خود شما بستگی دارد. من می­‌توانم میلیون­‌ها..",
    type: "articles",
  },
  {
    id: 19,
    title: "استراتژی اقیانوس آبی چیست؟",
    img: "./assets/images/articles/article-sm-4.webp",
    imgBig: "../assets/images/articles/article-lg-4.webp",
    caption:
      "	موفق شدن و رسیدن به خواسته‌ ها به خود شما بستگی دارد. من می­‌توانم میلیون­‌ها.",
    type: "articles",
  },
  {
    id: 20,
    title: "۹ ویژگی پنهان در کتابخانه چند رسانه ای وردپرس",
    img: "./assets/images/articles/article-sm-5.webp",
    imgBig: "../assets/images/articles/article-lg-5.webp",
    caption:
      "	امروز بیایید با ۹ ویژگی کتابخانه چندرسانه ای در وردپرس آشنا شوید تا بتوانید رسانه‌های را بهتر.",
    type: "articles",
  },
  {
    id: 21,
    title: "چگونه می توان رتبه الکسای سایت را بهبود داد؟",
    img: "./assets/images/articles/article-sm-6.webp",
    imgBig: "../assets/images/articles/article-lg-6.webp",
    caption:
      "یکی از روشهای موثر برای افزایش بازدید کننده و بهبود سئو، ارتقای رتبه الکسا است. در این نوشته.",
    type: "articles",
  },
  {
    id: 22,
    title: "چگونه موفق شویم؟ | چگونه در زندگی به هر چه می‌خواهیم برسیم؟",
    img: "./assets/images/articles/article-sm-7.webp",
    imgBig: "../assets/images/articles/article-lg-7.webp",
    caption:
      "موفق شدن و رسیدن به خواسته‌ ها به خود شما بستگی دارد. من می­‌توانم میلیون­‌ها...",
    type: "articles",
  },
  ///////////////////////////// End Articles //////////////////////////////////

  {
    id: 23,
    caption:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.",
    author: "محمد زینالی",
    role: "مدیر میم لرن",
    type: "comments",
  },
  {
    id: 24,
    caption:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.",
    author: " علی اقدم",
    role: "مدیر بتر استدیو",
    type: "comments",
  },
  {
    id: 25,
    caption:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.",
    author: "بیتا جیحون",
    role: "مدیر خوشحالی جات",
    type: "comments",
  },
  {
    id: 26,
    caption:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.",
    author: "مارک زاکربرگ،",
    role: "مدیر شرکت متا",
    type: "comments",
  },
  {
    id: 27,
    caption:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.",
    author: "پاول دوروف",
    role: "مدیرعامل پیام‌رسان تلگرام",
    type: "comments",
  },
  ///////////////////////////// End Comments //////////////////////////////////

  {
    id: 28,
    name: "مصطفی میر هادی",
    email: "mostafaHadi@gmail.com",
    phone: "09111111111",
    instagramAccount: "mostafaHadi1998",
    telegramAccount: "mostafaHadi1998",
    Location: "تهران، خیابان آزادی، خیابان بهبودی، ساختمان 110",
    role: "متخصص میم لرن",
    img: "../assets/images/teachers/teacher-1.webp",
    type: "teachers",
  },
  {
    id: 29,
    name: "محمد زینالی",
    email: "mhmdzynaly977@gmail.com",
    phone: "09222222222",
    instagramAccount: "zeynali2003",
    telegramAccount: "zeynali2003",
    Location: "تبریز ، منظریه",
    role: "توسعه دهنده میم لرن",
    img: "../assets/images/teachers/teacher-2.webp",
    type: "teachers",
  },
  {
    id: 30,
    name: "علی رحیمی",
    email: "alirahimi@gmail.com",
    phone: "09333333333",
    instagramAccount: "rahimi1995",
    telegramAccount: "rahimi1995",
    Location: "تهران ، شهریار",
    role: "مدیر آکادمی میم لرن",
    img: "../assets/images/teachers/teacher-3.webp",
    type: "teachers",
  },
  ///////////////////////////// End Teachers //////////////////////////////////

  {
    id: 31,
    title: "آدرس ایمیل",
    caption: "info@haji-studiare.com",
    avatar: (
      <span className="flex justify-center items-center w-12 h-12 rounded-full border border-[#69727d]">
        <FaEnvelopeOpenText className="w-6 h-6 text-[#69727d]" />
      </span>
    ),
    type: "communicationWithTheTeacherItems",
  },
  {
    id: 32,
    title: "شماره تماس",
    caption: "09374812449",
    avatar: (
      <span className="flex justify-center items-center w-12 h-12 rounded-full border border-[#69727d]">
        <FaMobileAlt className="w-6 h-6 text-[#69727d]" />
      </span>
    ),
    type: "communicationWithTheTeacherItems",
  },
  {
    id: 33,
    title: "صفحه اینستاگرام",
    caption: "@zeynali2003",
    avatar: (
      <span className="flex justify-center items-center w-12 h-12 rounded-full border border-[#EA1267]">
        <FaInstagram className="w-6 h-6 text-[#EA1267]" />
      </span>
    ),
    type: "communicationWithTheTeacherItems",
  },
  {
    id: 34,
    title: "تلگرام",
    caption: "@zeynali2003",
    avatar: (
      <span className="flex justify-center items-center w-12 h-12 rounded-full border border-[#00BCFF]">
        <FaTelegramPlane className="w-6 h-6 text-[#00BCFF]" />
      </span>
    ),
    type: "communicationWithTheTeacherItems",
  },
  {
    id: 35,
    title: "آدرس",
    caption: "تهران، خیابان آزادی، خیابان بهبودی، ساختمان 110",
    avatar: (
      <span className="flex justify-center items-center w-12 h-12 rounded-full border border-[#69727d]">
        <MdLocationPin className="w-6 h-6 text-[#69727d]" />
      </span>
    ),
    type: "communicationWithTheTeacherItems",
  },
  {
    id: 33,
    caption: `
     <div className="leading-8 mt-5 text-sm">
      <p>
        موفق شدن و رسیدن به خواسته‌ ها به خود شما بستگی دارد. من می­‌توانم
        میلیون­‌ها روش دیگر را در مورد اینکه چگونه موفق شویم؟ لیست کنم اما اگر
        شما تمایلی به انجام کار نداشته باشید، این روش‌­ها کار نخواهند کرد. دو
        انتخاب دارید:
      </p>
      <p>
        <span className="block">
          انتخاب اول: شروع کنید به ساخت چیزی مانند یک مغازه، یک وبلاگ، یک
          اپلیکیشن و…
        </span>
        انتخاب دوم: در مقابل خودتان اعتراف کنید که واقعا نمی­‌خواهید موفق شوید،
        بلکه تنها از این ایده خوشتان می­‌آید. بقیه روزتان را هم به دیدن یک نمایش
        ماراتون در نتفلیکس بگذرانید
      </p>
      <p className="mt-5">
        من از گذشته تا به حال و در طول 20 سال حضور در حرفه ورزشی، توسط تعدادی از
        مربیان کره زمین آموزش دیدم. اما زمانی که می­خواستم شرکت خودم را تاسیس
        کنم تا اطلاعات و دانشم راجع به روانشناسی و آموزش­‌هایی که دیده بودم را
        به اشتراک بگذارم، آن قدر که فکر می­‌کردم این کار، کار ساده‌­ای نبود. پس
        چگونه موفق شویم؟
      </p>
      <p>
        ایجاد یک کسب­ و کار جدید، کار ساده‌­ای نیست. شما باید فکر این باشید که
        پول ماهانه را کنار بگذارید تا بتوانید در ناشناخته‌­ها غرق شوید و اتفاقات
        غیرقابل پیش‌­بینی را تجربه کنید. بسیاری از چیزها ما را از جهش و تغییر
        دور می‌­کند. مانند ترس یا حس عدم امنیت؛ اما چیزی بیش از همه موارد ما را
        به پیش می‌برد: انگیزه.
      </p>
      <h3 className="text-xl my-2">چگونه موفق شویم؟</h3>
      <p className="mb-2">
        وقتی به روزهایی که ورزشکار بودم برمی­‌گردم، متوجه تفاوت می­‌شوم. به یاد
        می­‌آوردم که چه چیزی یا چه کسی مرا مجبور می­‌کرد تا به خودم فشار بیاورم،
        حتی زمانی که خودم نمی­‌خواستم. تفاوت اینجا بود که من به عنوان یک
        ورزشکار، روزهای ساختار یافته و مشخصی داشتم و باید برای هر روز به مربی
        خود گزارش می‌­دادم. برنامه ساختار یافته، ما را متمرکز نگه می­‌دارد. مربی
        نیز به ما فشار می­‌آورد و ما را به چالش می‌­کشد.
      </p>
      <p className="mb-2">
        خوشبختانه من از این مرحله گذر کردم و آموزش Onbo را پیدا کردم. Onbo یک
        سرویس مربیگری آنلاین است که به مردم کمک می‌­کند تا به اهداف خود برسند.
        من تصمیم گرفتم تا درس­‌هایی که تاکنون یاد گرفت‌ه­ام را جمع­‌آوری کنم و
        آنها را با دیگر افرادی مانند شما، که تلاش می­‌کنند فرد بهتری باشند و
        برای رسیدن به خواسته ها مصمم هستند؛ به اشتراک بگذارم. برای رسیدن به
        موفقیت حتما این نکات را مطالعه کنید.
      </p>
      <h4 className="text-base font-vazirMedium mt-3 mb-2">
        1- از پیدا کردن گلوله نقره‌­ای و جادویی دست بردارید
      </h4>
      <p className="mb-2">
        گلوله نقره‌­ای چیزی است که نیاز دارید تا هر روز و به مدت سال­‌ها، در کار
        خود قرار دهید. این گلوله نه هکی در تبلیغات فیسبوک است و نه یک کنفرانس
        2000 دلاری جادویی.
      </p>
      <p className="mb-2">
        مهم نیست چندبار مردم به شما می‌گویند که باید همچنان در اطراف بگردید تا
        پاسخ این راز مخفی را پیدا کنید. چرا مهم نیست؟ اگر مهم نیست پس چگونه موفق
        شویم؟ چون شما نمی­‌خواهید آن را در کار خود استفاده کنید. شما تنها
        می­‌خواهید که یک شبه به موفقیت برسید. این امکان‌­پذیر نیست. اگر من به
        جای شما بودم، شروع می­‌کردم به ایجاد اهداف بهتر.
      </p>
      <h4 className="text-base font-vazirMedium mt-3 mb-2">
        2- تلاش کنید تا اهداف بهتری ایجاد کنید
      </h4>
      <p className="mb-2">
        “هدف من این است که یک تُن پول بدست بیاورم.” و شما در تعجب هستید که چرا
        تا به حال این مقدار پول را بدست نیاورده‌­اید! هدف شما عملی نیست. اگر
        بخواهیم واضح بگوییم، این هدف انگیزه‌­ای هم ایجاد نمی­‌کند. پول خیلی خوب
        است اما شما را خشنود و کامل نمی­‌کند هدف اصلی شما از زندگی چیست؟ شاید
        موفق بودن برای شما به این معنی است که کاری کنید که اقیانوس­‌های جهان
        تمیز شوند یا به حیوانات کمک کنید و از منقرض شدن آن‌ها جلوگیری کنید. با
        این حال، شما این کار را چگونه انجام می­‌دهید؟
      </p>
      <p className="mb-2">
        بسیار خوب، شما به پول نیاز دارید و این جایی است که هدف پول معنا پیدا
        می­‌کند. چقدر پول لازم دارید تا به حل شدن این مشکلات کمک کنید؟ یک ماشین
        حساب بردارید. از برخی افراد بی دغدغه کمک بگیرید و شروع به محاسبه اعداد
        کنید. سپس عدد دقیق محاسبه شده را هدف خود قرار دهید و یک تاریخ دقیق برای
        رسیدن به آن یادداشت کنید. “من می­خواهم 103.467.37 دلار را تا 31 دسامبر
        2018 بدست آوردم و آن را برای تمیز کردن اقیانوس‌های دنیا سرمایه­‌گذاری
        کنم تا بدین ترتیب بتوانم از اقیانوس محافظت کنم و آب نوشیدنی تمیزی داشته
        باشم.” حالا هم یک هدف مشخص دارید و هم یک روز برای رسیدن به آن.
      </p>
      <h4 className="text-base font-vazirMedium mt-3 mb-2">
        3- به دنبال تایید نباشید
      </h4>
      <p className="mb-2">
        verify- تایید کردن شما اگر می‌خواهید بدانید چگونه موفق شویم؟ لطفا هرگز
        به دنبال تایید نباشید. قرار نیست آن راه را در افرادی که اطراف شما هستند
        پیدا کنید. مگر اینکه هر کس که در اطراف شماست موفقیت بزرگی به دست آورده
        باشد. نیازی نیست مادر، پدر، بهترین دوستان، شریک و سگ شما ایده­‌های کاری
        شما را تایید کنند. زندگی را به روش خودتان و آن‌طور که می­‌خواهید زندگی
        کنید. دنبال این نباشید که دیگران تایید کنند که شما در مسیر درست قرار
        دارید.
      </p>
      <p className="mb-2">
        می­‌خواهید بدانید آیا در مسیر درست هستید یا نه؟ از خودتان بپرسید “آیا در
        حال حاضر آن‌طور که می‌­خواهم زندگی می­‌کنم؟” اگر جواب شما مثبت بود، در
        مسیر درست قرار دارید. اگر جواب منفی بود، باید تغییراتی در زندگی خود
        ایجاد کنید. نگذارید دیگر افراد ذهن شما را به هم بریزند. مردم همیشه فکر
        می­‌کنند که می­‌دانند بهترین چیز برای شما چیست. اما این فقط شما هستید که
        جواب را می­‌دانید. کمی بیشتر به خودتان اعتماد کنید. خواهید فهمید که
        می­‌دانید چه کاری باید انجام دهید.
      </p>
      <h4 className="text-base font-vazirMedium mt-3 mb-2">
        4- زندگی رویایی خود را داشته باشید
      </h4>
      <p className="mb-2">
        موفق شدن در زندگی این نیست که در یک لحظه جادویی، همه چیز در سر جای خود
        قرار بگیرد. موفق شدن مربوط به لحظات کوچک در طول این مدت است. لحظاتی که
        شما خوشحال هستید و به دنبال رسیدن به خواسته‌ ها به سر می‌برید. لحظاتی که
        واقعا در آن غرق شده­‌اید.
      </p>
      <p className="mb-2">
        حقیقت آن است که شما می‌­توانید این لحظات را تجربه کنید، حتی اگر در حال
        حاضر در کاری خسته کننده گیر کرده باشید. اگر هدف شما این است که یک کسب­ و
        کار آنلاین راه بیاندازید، بعد از ظهرها و آخر هفته­‌هایی را خواهید داشت
        که می­‌توانید این کار را شروع کنید. شاید بخواهید که از راه دور کار کنید.
        در این حالت می‌­توانید با رئیس خود صحبت کرده و در مدت زمانی که در شهر
        خود نیستید، کارهایتان را از راه دور انجام دهید.
      </p>
    </div>
    `, 
    type: "",
  },
];

export default allData;
